app/controllers/histories_controller.rb

  def create
    @history = History.new(history_params)
    @history.user = helpers.current_user
    respond_to do |format|
      if @history.save
---
INSERT INTO "histories" ("title", "picture", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @history.update(history_params)
---
UPDATE "histories" SET "title" = ?, "picture" = ?, "updated_at" = ? WHERE "histories"."id" = ?  [["title", "Mario Bros."], ["picture", "imagen-de-mario-sin-bigote-deja-en-shock-a-muchos--256300-jpg_700x0.jpg"], ["updated_at", "2018-08-08 01:02:57.203547"], ["id", 1]]

    def set_history
      @history = History.find(params[:id])
---
SELECT  "histories".* FROM "histories" WHERE "histories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]