app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "Juanito@gmail.com"], ["LIMIT", 1]]
---
  def create
    u = User.find_by(email: params[:user][:email])